<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"40f3fe91366207ad1cee2d359e7e618ea4b9352c8b1bb9af4efe07af743268fc","plan_job_ref":"Job .github/workflows/_test-tf.yaml #99 at https://github.com/DND-IT/github-workflows/actions/runs/16682351313","plan_out_hash":"b6eb47810a3ba563c536dbe628cd6e9b3cbfa95153ba37cb6a3f1646031cfaa4","plan_hash":"204792260ff38659f4209ff07063c31fcf3d75f1da2ab9bf4971d17f1be3f68f","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #99](https://github.com/DND-IT/github-workflows/actions/runs/16682351313)